package com.example.dogcatsquare.data.model.login

object RegionData {
    val regions = listOf(
        Region(
            name = "서울",
            subRegions = listOf(
                SubRegion(name = "서울 전체", districts = listOf("")),
                SubRegion(name = "강남구", districts = listOf(
                    "강남구 전체",
                    "개포1동", "개포2동", "개포4동", "논현1동", "논현2동",
                    "대치1동", "대치2동", "대치4동", "삼성1동", "삼성2동",
                    "세곡동", "수서동", "역삼1동", "역삼2동", "율현동",
                    "일원1동", "일원2동", "일원본동", "자곡동"
                )),
                SubRegion(name = "강동구", districts = listOf(
                    "강동구 전체",
                    "강일동", "고덕1동", "고덕2동", "길동", "둔촌1동",
                    "둔촌2동", "명일1동", "명일2동", "상일동", "성내1동",
                    "성내2동", "성내3동", "암사1동", "암사2동", "암사3동",
                    "천호1동", "천호2동", "천호3동"
                )),
                SubRegion(name = "강북구", districts = listOf(
                    "강북구 전체",
                    "미아동", "번1동", "번2동", "번3동", "삼각산동",
                    "삼양동", "송중동", "송천동", "수유1동", "수유2동",
                    "수유3동", "우이동", "인수동"
                )),
                SubRegion(name = "강서구", districts = listOf(
                    "강서구 전체",
                    "가양1동", "가양2동", "가양3동", "공항동", "등촌1동",
                    "등촌2동", "등촌3동", "발산1동", "방화1동", "방화2동",
                    "방화3동", "염창동", "우장산동", "화곡1동", "화곡2동",
                    "화곡3동", "화곡4동", "화곡6동", "화곡8동", "화곡본동"
                )),
                SubRegion(name = "관악구", districts = listOf(
                    "관악구 전체",
                    "낙성대동", "난곡동", "난향동", "남현동", "대림동",
                    "미성동", "삼성동", "서원동", "성현동", "신림동",
                    "신사동", "은천동", "인헌동", "조원동", "중앙동",
                    "청룡동", "청림동", "행운동"
                )),
                SubRegion(name = "광진구", districts = listOf(
                    "광진구 전체",
                    "광장동", "구의1동", "구의2동", "구의3동", "군자동",
                    "능동", "자양1동", "자양2동", "자양3동", "자양4동",
                    "중곡1동", "중곡2동", "중곡3동", "중곡4동", "화양동"
                )),
                SubRegion(name = "구로구", districts = listOf(
                    "구로구 전체",
                    "가리봉동", "개봉1동", "개봉2동", "개봉3동", "고척1동",
                    "고척2동", "구로1동", "구로2동", "구로3동", "구로4동",
                    "구로5동", "수궁동", "신도림동", "오류1동", "오류2동"
                )),
                SubRegion(name = "금천구", districts = listOf(
                    "금천구 전체",
                    "가산동", "독산1동", "독산2동", "독산3동", "독산4동",
                    "시흥1동", "시흥2동", "시흥3동", "시흥4동", "시흥5동"
                )),
                SubRegion(name = "노원구", districts = listOf(
                    "노원구 전체",
                    "공릉1동", "공릉2동", "상계10동", "상계1동", "상계2동",
                    "상계3·4동", "상계5동", "상계6·7동", "상계8동", "상계9동",
                    "월계1동", "월계2동", "월계3동", "중계1동", "중계2·3동",
                    "중계4동", "중계본동", "하계1동", "하계2동"
                )),
                SubRegion(name = "도봉구", districts = listOf(
                    "도봉구 전체",
                    "도봉1동", "도봉2동", "방학1동", "방학2동", "방학3동",
                    "상계1동", "상계2동", "쌍문1동", "쌍문2동", "쌍문3동",
                    "쌍문4동", "창1동", "창2동", "창3동", "창4동", "창5동"
                )),
                SubRegion(name = "동대문구", districts = listOf(
                    "동대문구 전체",
                    "답십리1동", "답십리2동", "용신동", "이문1동", "이문2동",
                    "장안1동", "장안2동", "전농1동", "전농2동", "제기동",
                    "청량리동", "회기동", "휘경1동", "휘경2동"
                )),
                SubRegion(name = "동작구", districts = listOf(
                    "동작구 전체",
                    "노량진1동", "노량진2동", "대방동", "본동", "사당1동",
                    "사당2동", "사당3동", "사당4동", "사당5동", "상도1동",
                    "상도2동", "상도3동", "상도4동", "신대방1동", "신대방2동",
                    "흑석동"
                )),
                SubRegion(name = "마포구", districts = listOf(
                    "마포구 전체",
                    "공덕동", "대흥동", "도화동", "망원1동", "망원2동",
                    "상암동", "서강동", "서교동", "성산1동", "성산2동",
                    "신수동", "아현동", "연남동", "염리동", "용강동", "합정동"
                )),
                SubRegion(name = "서대문구", districts = listOf(
                    "서대문구 전체",
                    "남가좌1동", "남가좌2동", "북가좌1동", "북가좌2동",
                    "북아현동", "신촌동", "연희동", "천연동", "충현동",
                    "홍은1동", "홍은2동", "홍제1동", "홍제2동", "홍제3동"
                )),
                SubRegion(name = "서초구", districts = listOf(
                    "서초구 전체",
                    "내곡동", "반포1동", "반포2동", "반포3동", "반포4동",
                    "반포본동", "방배1동", "방배2동", "방배3동", "방배4동",
                    "방배본동", "서초1동", "서초2동", "서초3동", "서초4동",
                    "양재1동", "양재2동", "잠원동"
                )),
                SubRegion(name = "성동구", districts = listOf(
                    "성동구 전체",
                    "금호1가동", "금호2·3가동", "금호4가동", "마장동",
                    "사근동", "성수1가1동", "성수1가2동", "성수2가1동",
                    "성수2가3동", "송정동", "옥수동", "왕십리도선동",
                    "용답동", "응봉동", "행당1동", "행당2동"
                )),
                SubRegion(name = "성북구", districts = listOf(
                    "성북구 전체",
                    "길음1동", "길음2동", "돈암1동", "돈암2동", "동선동",
                    "보문동", "삼선동", "석관동", "성북동", "안암동",
                    "월곡1동", "월곡2동", "장위1동", "장위2동", "장위3동",
                    "정릉1동", "정릉2동", "정릉3동", "정릉4동", "종암동"
                )),
                SubRegion(name = "송파구", districts = listOf(
                    "송파구 전체",
                    "가락1동", "가락2동", "가락본동", "거여1동", "거여2동",
                    "마천1동", "마천2동", "문정1동", "문정2동", "방이1동",
                    "방이2동", "삼전동", "석촌동", "송파1동", "송파2동",
                    "오금동", "오륜동", "위례동", "장지동", "풍납1동", "풍납2동"
                )),
                SubRegion(name = "양천구", districts = listOf(
                    "양천구 전체",
                    "목1동", "목2동", "목3동", "목4동", "목5동", "신월1동",
                    "신월2동", "신월3동", "신월4동", "신월5동", "신월6동",
                    "신월7동", "신정1동", "신정2동", "신정3동", "신정4동",
                    "신정6동", "신정7동"
                )),
                SubRegion(name = "영등포구", districts = listOf(
                    "영등포구 전체",
                    "당산1동", "당산2동", "대림1동", "대림2동", "대림3동",
                    "도림동", "문래동", "신길1동", "신길3동", "신길4동",
                    "신길5동", "신길6동", "신길7동", "양평1동", "양평2동",
                    "여의동", "영등포동", "영등포본동"
                )),
                SubRegion(name = "용산구", districts = listOf(
                    "용산구 전체",
                    "남영동", "보광동", "서빙고동", "용문동", "용산2가동",
                    "원효로1동", "원효로2동", "이촌1동", "이촌2동", "이태원1동",
                    "이태원2동", "청파동", "한강로동", "한남동", "효창동", "후암동"
                )),
                SubRegion(name = "은평구", districts = listOf(
                    "은평구 전체",
                    "갈현1동", "갈현2동", "구산동", "녹번동", "대조동",
                    "불광1동", "불광2동", "수색동", "신사1동", "신사2동",
                    "역촌동", "응암1동", "응암2동", "응암3동", "증산동", "진관동"
                )),
                SubRegion(name = "종로구", districts = listOf(
                    "종로구 전체",
                    "가회동", "교남동", "무악동", "부암동", "사직동",
                    "삼청동", "숭인1동", "숭인2동", "이화동", "종로1·2·3·4가동",
                    "종로5·6가동", "창신1동", "창신2동", "창신3동", "청운효자동",
                    "평창동", "혜화동"
                )),
                SubRegion(name = "중구", districts = listOf(
                    "중구 전체",
                    "광희동", "명동", "소공동", "신당5동", "을지로동",
                    "장충동", "중림동", "필동", "황학동", "회현동"
                )),
                SubRegion(name = "중랑구", districts = listOf(
                    "중랑구 전체",
                    "망우3동", "망우본동", "면목2동", "면목3·8동", "면목4동",
                    "면목5동", "면목7동", "면목본동", "묵1동", "묵2동",
                    "상봉1동", "상봉2동", "신내1동", "신내2동", "중화1동", "중화2동"
                ))
            )
        ),
        Region(
            name = "경기",
            subRegions = listOf(
                SubRegion(name = "가평군", districts = listOf("가평읍", "북면", "상면", "설악면", "조종면", "청평면")),
                SubRegion(name = "고양시", districts = listOf("가좌동", "고봉동", "고양동", "관산동", "능곡동", "대덕동", "대화동", "덕이동", "마두1동", "마두2동", "백석1동", "백석2동", "삼송1동", "삼송2동", "성사1동", "성사2동", "송포동", "식사동", "원신동", "일산1동", "일산2동", "일산3동", "장항1동", "장항2동", "정발산동", "주교동", "주엽1동", "주엽2동", "중산1동", "중산2동", "창릉동", "탄현1동", "탄현2동", "풍산동", "행신1동", "행신2동", "행신3동", "행주동", "화전동", "효자동", "흥도동")),
                SubRegion(name = "과천시", districts = listOf("갈현동", "과천동", "문원동", "별양동", "부림동", "중앙동")),
                SubRegion(name = "광명시", districts = listOf("광명1동", "광명2동", "광명3동", "광명4동", "광명5동", "광명6동", "광명7동", "소하1동", "소하2동", "일직동", "철산1동", "철산2동", "철산3동", "철산4동", "하안1동", "하안2동", "하안3동", "하안4동", "학온동")),
                SubRegion(name = "광주시", districts = listOf("경안동", "곤지암읍", "광남1동", "광남2동", "남종면", "남한산성면", "도척면", "송정동", "초월읍", "탄벌동", "퇴촌면")),
                SubRegion(name = "구리시", districts = listOf("갈매동", "교문1동", "교문2동", "동구동", "수택1동", "수택2동", "수택3동", "인창동")),
                SubRegion(name = "군포시", districts = listOf("광정동", "군포1동", "군포2동", "금정동", "대야동", "산본1동", "산본2동", "수리동", "오금동", "재궁동")),
                SubRegion(name = "김포시", districts = listOf("걸포동", "고촌읍", "구래동", "대곶면", "마산동", "북변동", "사우동", "양촌읍", "운양동", "월곶면", "장기동", "장기본동", "통진읍", "풍무동", "하성면")),
                SubRegion(name = "남양주시", districts = listOf("금곡동", "다산1동", "다산2동", "별내동", "별내면", "수동면", "양정동", "오남읍", "와부읍", "조안면", "진건읍", "진접읍", "퇴계원읍", "평내동", "호평동")),
                SubRegion(name = "동두천시", districts = listOf("보산동", "불현동", "상패동", "생연1동", "생연2동", "소요동", "송내동", "중앙동")),
                SubRegion(name = "부천시", districts = listOf("대산동", "도당동", "범안동", "상1동", "상2동", "상3동", "상동", "성곡동", "소사본동", "송내1동", "송내2동", "신중동", "심곡1동", "심곡2동", "심곡본1동", "심곡본동", "약대동", "역곡1동", "역곡2동", "오정동", "원미동", "중1동", "중2동", "중3동", "중4동", "중5동", "춘의동")),
                SubRegion(name = "성남시", districts = listOf("구미1동", "구미2동", "금곡동", "금광1동", "금광2동", "단대동", "도촌동", "백현동", "복정동", "분당동", "산성동", "삼평동", "상대원1동", "상대원2동", "상대원3동", "상대원동", "성남동", "수내1동", "수내2동", "수내3동", "수진1동", "수진2동", "신촌동", "신흥1동", "신흥2동", "신흥3동", "야탑1동", "야탑2동", "야탑3동", "양지동", "운중동", "위례동", "은행1동", "은행2동", "이매1동", "이매2동", "정자1동", "정자2동", "정자3동", "정자동", "중앙동", "태평1동", "태평2동", "태평3동", "판교동", "하대원동")),
                SubRegion(name = "수원시", districts = listOf("고등동", "광교1동", "광교2동", "구운동", "금곡동", "매교동", "매산동", "매탄1동", "매탄2동", "매탄3동", "매탄4동", "서둔동", "세류1동", "세류2동", "세류3동", "송죽동", "신동", "연무동", "영통1동", "영통2동", "영통3동", "영화동", "우만1동", "우만2동", "원천동", "율천동", "인계동", "입북동", "정자1동", "정자2동", "정자3동", "조원1동", "조원2동", "지동", "태장동", "파장동", "평동", "행궁동", "호매실동", "화서1동", "화서2동")),
                SubRegion(name = "시흥시", districts = listOf("군자동", "대야동", "매화동", "목감동", "배곧1동", "배곧2동", "신천동", "신현동", "월곶동", "은행동", "정왕1동", "정왕2동", "정왕3동", "정왕4동", "정왕본동")),
                SubRegion(name = "안산시", districts = listOf("고잔동", "대부동", "본오1동", "본오2동", "본오3동", "부곡동", "사동", "사이동", "선부1동", "선부2동", "선부3동", "성포동", "신길동", "안산동", "와동", "원곡동", "월피동", "이동", "일동", "중앙동", "초지동", "해양동", "호수동")),
                SubRegion(name = "안성시", districts = listOf("고삼면", "공도읍", "금광면", "대덕면", "미양면", "보개면", "서운면", "안성1동", "안성2동", "안성3동", "양성면")),
                SubRegion(name = "안양시", districts = listOf("관양1동", "관양2동", "귀인동", "달안동", "박달1동", "박달2동", "범계동", "부림동", "부흥동", "비산1동", "비산2동", "비산3동", "석수1동", "석수2동", "석수3동", "신촌동", "안양10동", "안양1동", "안양2동", "안양3동", "안양4동", "안양5동", "안양6동", "안양7동", "안양8동", "안양9동", "평촌동", "호계1동", "호계2동", "호계3동")),
                SubRegion(name = "양주시", districts = listOf("광적면", "남면", "백석읍", "양주1동", "양주2동", "은현면", "장흥면", "회천1동", "회천2동", "회천3동", "회천4동")),
                SubRegion(name = "양평군", districts = listOf("강상면", "강하면", "개군면", "단월면", "서종면", "양동면", "양서면", "양평읍", "옥천면", "용문면", "지평면", "청운면")),
                SubRegion(name = "여주시", districts = listOf("가남읍", "강천면", "금사면", "대신면", "북내면", "세종대왕면", "여흥동", "오학동", "점동면", "중앙동", "흥천면")),
                SubRegion(name = "연천군", districts = listOf("군남면", "미산면", "백학면", "신서면", "연천읍", "왕징면", "장남면", "전곡읍", "중면", "청산면")),
                SubRegion(name = "오산시", districts = listOf("남촌동", "대원동", "세마동", "신장동", "중앙동", "초평동")),
                SubRegion(name = "용인시", districts = listOf("고림동", "구갈동", "구성동", "기흥동", "남사읍", "동백1동", "동백2동", "동백3동", "동부동", "마북동", "모현읍", "백암면", "보라동", "보정동", "삼가동", "상갈동", "상현1동", "상현2동", "상현3동", "서농동", "신갈동", "양지면", "역삼동", "영덕1동", "영덕2동", "원삼면", "유림동", "이동읍", "죽전1동", "죽전2동", "죽전3동", "중앙동", "포곡읍", "풍덕천1동", "풍덕천2동")),
                SubRegion(name = "의왕시", districts = listOf("고천동", "내손1동", "내손2동", "부곡동", "오전동", "청계동")),
                SubRegion(name = "의정부시", districts = listOf("가능동", "송산1동", "송산2동", "송산3동", "신곡1동", "신곡2동", "의정부1동", "의정부2동", "자금동", "호원1동", "호원2동", "흥선동")),
                SubRegion(name = "이천시", districts = listOf("관고동", "대월면", "마장면", "모가면", "설성면", "안흥동", "율면", "장호원읍", "중리동", "증포동", "창전동", "호법면")),
                SubRegion(name = "파주시", districts = listOf("광탄면", "교하동", "군내면", "금촌1동", "금촌2동", "금촌3동", "문산읍", "법원읍", "운정1동", "운정2동", "운정3동", "월롱면", "적성면", "조리읍", "탄현면", "파주읍", "파평면")),
                SubRegion(name = "평택시", districts = listOf("고덕동", "비전1동", "비전2동", "서정동", "세교동", "송탄동", "신장1동", "신장2동", "안중읍", "원평동", "중앙동", "청북읍", "통복동", "팽성읍", "포승읍")),
                SubRegion(name = "포천시", districts = listOf("가산면", "관인면", "군내면", "내촌면", "선단동", "소흘읍", "신북면", "영북면", "영중면", "이동면", "일동면", "창수면", "포천동", "화현면")),
                SubRegion(name = "하남시", districts = listOf("감북동", "감일동", "덕풍1동", "덕풍2동", "덕풍3동", "미사1동", "미사2동", "신장1동", "신장2동", "위례동", "천현동", "초이동", "춘궁동", "풍산동")),
                SubRegion(name = "화성시", districts = listOf("기배동", "남양읍", "동탄1동", "동탄2동", "동탄3동", "동탄4동", "동탄5동", "동탄6동", "마도면", "매송면", "반월동", "병점1동", "병점2동", "봉담읍", "비봉면", "서신면", "송산면", "양감면", "우정읍", "장안면", "정남면", "진안동", "팔탄면", "향남읍", "화산동"))
            )
        ),
        Region(
            name = "인천",
            subRegions = listOf(
                SubRegion(name = "인천 전체", districts = listOf("")),
                SubRegion(name = "강화군", districts = listOf(
                    "강화군 전체",
                    "강화읍", "교동면", "길상면", "내가면", "불은면", "삼산면",
                    "서도면", "선원면", "송해면", "양도면", "양사면", "하점면", "화도면"
                )),
                SubRegion(name = "계양구", districts = listOf(
                    "계양구 전체",
                    "계산1동", "계산2동", "계산3동", "계산4동", "방축동", "병방동",
                    "서운동", "용종동", "임학동", "작전1동", "작전2동", "작전서운동",
                    "효성1동", "효성2동"
                )),
                SubRegion(name = "남동구", districts = listOf(
                    "남동구 전체",
                    "간석1동", "간석2동", "간석3동", "간석4동", "구월1동", "구월2동",
                    "구월3동", "구월4동", "남촌도림동", "논현1동", "논현2동", "논현고잔동",
                    "만수1동", "만수2동", "만수3동", "만수4동", "만수5동", "만수6동",
                    "서창2동", "장수서창동"
                )),
                SubRegion(name = "동구", districts = listOf(
                    "동구 전체",
                    "만석동", "송현1·2동", "송현3동", "창영동", "화수1·화평동",
                    "화수2동"
                )),
                SubRegion(name = "미추홀구", districts = listOf(
                    "미추홀구 전체",
                    "관교동", "도화1동", "도화2·3동", "문학동", "숭의1·3동", "숭의2동",
                    "숭의4동", "용현1·4동", "용현2동", "용현3동", "용현5동", "주안1동",
                    "주안2동", "주안3동", "주안4동", "주안5동", "주안6동", "주안7동",
                    "주안8동", "학익1동", "학익2동"
                )),
                SubRegion(name = "부평구", districts = listOf(
                    "부평구 전체",
                    "갈산1동", "갈산2동", "부개1동", "부개2동", "부개3동", "부평1동",
                    "부평2동", "부평3동", "부평4동", "부평5동", "부평6동", "부평7동",
                    "산곡1동", "산곡2동", "산곡3동", "산곡4동", "삼산1동", "삼산2동",
                    "십정1동", "십정2동", "일신동", "청천1동", "청천2동"
                )),
                SubRegion(name = "서구", districts = listOf(
                    "서구 전체",
                    "가정1동", "가정2동", "가정3동", "가좌1동", "가좌2동", "가좌3동",
                    "가좌4동", "검단동", "검암경서동", "금곡동", "당하동", "마전동",
                    "불로대곡동", "석남1동", "석남2동", "석남3동", "신현원창동",
                    "연희동", "오류왕길동", "완정동", "원당동"
                )),
                SubRegion(name = "연수구", districts = listOf(
                    "연수구 전체",
                    "동춘1동", "동춘2동", "동춘3동", "선학동", "송도1동", "송도2동",
                    "송도3동", "송도4동", "송도5동", "송도6동", "연수1동", "연수2동",
                    "연수3동", "옥련1동", "옥련2동", "청학동"
                )),
                SubRegion(name = "옹진군", districts = listOf(
                    "옹진군 전체",
                    "대청면", "덕적면", "백령면", "북도면", "영흥면", "자월면"
                )),
                SubRegion(name = "중구", districts = listOf(
                    "중구 전체",
                    "개항동", "도원동", "동인천동", "신포동", "신흥동", "연안동",
                    "영종1동", "영종2동", "용유동", "운서동", "율목동"
                ))
            )
        ),
        Region(
            name = "대구",
            subRegions = listOf(
                SubRegion(name = "대구 전체", districts = listOf("")),
                SubRegion(name = "남구", districts = listOf(
                    "남구 전체",
                    "대명10동", "대명1동", "대명2동", "대명3동", "대명4동", "대명5동",
                    "대명6동", "대명9동", "봉덕1동", "봉덕2동", "봉덕3동", "이천동"
                )),
                SubRegion(name = "달서구", districts = listOf(
                    "달서구 전체",
                    "감삼동", "도원동", "두류1·2동", "두류3동", "본동", "본리동",
                    "상인1동", "상인2동", "상인3동", "성당동", "송현1동", "송현2동",
                    "신당동", "용산1동", "용산2동", "월성1동", "월성2동", "이곡1동",
                    "이곡2동", "장기동", "죽전동", "진천동"
                )),
                SubRegion(name = "달성군", districts = listOf(
                    "달성군 전체",
                    "가창면", "구지면", "논공읍", "다사읍", "옥포읍", "유가읍",
                    "하빈면", "현풍읍", "화원읍"
                )),
                SubRegion(name = "동구", districts = listOf(
                    "동구 전체",
                    "공산동", "도평동", "동촌동", "방촌동", "불로·봉무동", "신암1동",
                    "신암2동", "신암3동", "신암4동", "신암5동", "신천1·2동", "신천3동",
                    "신천4동", "안심1동", "안심2동", "안심3동", "안심4동", "지저동",
                    "해안동", "혁신동", "효목1동", "효목2동"
                )),
                SubRegion(name = "북구", districts = listOf(
                    "북구 전체",
                    "검단동", "고성동", "관문동", "관음동", "구암동", "노원동",
                    "대현동", "동천동", "무태조야동", "복현1동", "복현2동", "산격1동",
                    "산격2동", "산격3동", "산격4동", "읍내동", "칠성동", "침산1동",
                    "침산2동", "침산3동", "태전1동", "태전2동"
                )),
                SubRegion(name = "서구", districts = listOf(
                    "서구 전체",
                    "내당1동", "내당2·3동", "내당4동", "비산1동", "비산2·3동",
                    "비산4동", "비산5동", "비산6동", "비산7동", "상중이동", "원대동",
                    "평리1동", "평리2동", "평리3동", "평리4동", "평리5동", "평리6동"
                )),
                SubRegion(name = "수성구", districts = listOf(
                    "수성구 전체",
                    "고산1동", "고산2동", "고산3동", "두산동", "만촌1동", "만촌2동",
                    "만촌3동", "범물1동", "범물2동", "범어1동", "범어2동", "범어3동",
                    "범어4동", "상동", "수성1가동", "수성2·3가동", "수성4가동", "중동",
                    "지산1동", "지산2동", "파동", "황금1동", "황금2동"
                )),
                SubRegion(name = "중구", districts = listOf(
                    "중구 전체",
                    "남산1동", "남산2동", "남산3동", "남산4동", "대신동", "동인동",
                    "삼덕동", "성내1동", "성내2동", "성내3동"
                ))
            )
        ),
        Region(
            name = "광주",
            subRegions = listOf(
                SubRegion(name = "광주 전체", districts = listOf("")),
                SubRegion(name = "광산구", districts = listOf(
                    "광산구 전체",
                    "도산동", "동곡동", "본량동", "비아동", "삼도동", "송정1동",
                    "송정2동", "수완동", "신창동", "신흥동", "어룡동", "우산동",
                    "운남동", "월곡1동", "월곡2동", "임곡동", "첨단1동", "첨단2동",
                    "평동", "하남동"
                )),
                SubRegion(name = "남구", districts = listOf(
                    "남구 전체",
                    "대촌동", "방림1동", "방림2동", "백운1동", "백운2동", "봉선1동",
                    "봉선2동", "사직동", "송암동", "양림동", "월산4동", "월산5동",
                    "월산동", "주월1동", "주월2동", "효덕동"
                )),
                SubRegion(name = "동구", districts = listOf(
                    "동구 전체",
                    "계림1동", "계림2동", "동명동", "산수1동", "산수2동", "서남동",
                    "지산1동", "지산2동", "지원1동", "지원2동", "충장동", "학동", "학운동"
                )),
                SubRegion(name = "북구", districts = listOf(
                    "북구 전체",
                    "건국동", "동림동", "두암1동", "두암2동", "두암3동", "매곡동",
                    "문화동", "문흥1동", "문흥2동", "삼각동", "석곡동", "신안동",
                    "신용동", "양산동", "오치1동", "오치2동", "우산동", "운암1동",
                    "운암2동", "운암3동", "일곡동", "임동", "중앙동", "중흥1동",
                    "중흥2동", "중흥3동", "풍향동"
                )),
                SubRegion(name = "서구", districts = listOf(
                    "서구 전체",
                    "광천동", "금호1동", "금호2동", "농성1동", "농성2동", "상무1동",
                    "상무2동", "서창동", "양동", "유덕동", "치평동", "화정1동",
                    "화정2동", "화정3동", "화정4동"
                ))
            )
        ),
        Region(
            name = "부산",
            subRegions = listOf(
                SubRegion(name = "중구", districts = listOf("광복동", "남포동", "대청동", "보수동", "부평동", "신창동", "영주동", "창선동", "토성동", "동광동")),
                SubRegion(name = "서구", districts = listOf("동대신동", "서대신동", "부용동", "아미동", "암남동", "초장동", "충무동", "토성동", "남부민동", "부민동")),
                SubRegion(name = "동구", districts = listOf("범일동", "수정동", "좌천동", "초량동")),
                SubRegion(name = "영도구", districts = listOf("남항동", "대교동", "대평동", "동삼동", "봉래동", "신선동", "영선동", "청학동")),
                SubRegion(name = "부산진구", districts = listOf("가야동", "개금동", "당감동", "범천동", "부암동", "부전동", "양정동", "연지동", "전포동", "초읍동", "당감1동", "당감2동")),
                SubRegion(name = "동래구", districts = listOf("낙민동", "명륜동", "복산동", "사직동", "안락동", "온천동")),
                SubRegion(name = "남구", districts = listOf("감만동", "대연동", "문현동", "용당동", "우암동", "용호동")),
                SubRegion(name = "북구", districts = listOf("구포동", "금곡동", "덕천동", "만덕동", "화명동")),
                SubRegion(name = "해운대구", districts = listOf("반여동", "반송동", "재송동", "좌동", "중동", "우동")),
                SubRegion(name = "사하구", districts = listOf("감천동", "괴정동", "구평동", "당리동", "다대동", "신평동", "장림동", "하단동")),
                SubRegion(name = "금정구", districts = listOf("구서동", "금사동", "금성동", "남산동", "두구동", "부곡동", "서동", "선두구동", "청룡동", "장전동")),
                SubRegion(name = "강서구", districts = listOf("강동동", "구랑동", "녹산동", "명지동", "대저동", "죽림동", "지사동")),
                SubRegion(name = "연제구", districts = listOf("거제동", "연산동")),
                SubRegion(name = "수영구", districts = listOf("광안동", "남천동", "망미동", "민락동", "수영동")),
                SubRegion(name = "사상구", districts = listOf("감전동", "괘법동", "덕포동", "모라동", "삼락동", "엄궁동", "학장동")),
                SubRegion(name = "기장군", districts = listOf("기장읍", "일광읍", "장안읍", "정관읍", "철마면"))
            )
        ),
        Region(
            name = "강원",
            subRegions = listOf(
                SubRegion(name = "강원 전체", districts = listOf("")),
                SubRegion(name = "강릉시", districts = listOf(
                    "강릉시 전체",
                    "강남동", "강동면", "교1동", "교2동", "구정면", "내곡동",
                    "사천면", "성산면", "송정동", "연곡면", "옥계면", "옥천동",
                    "왕산면", "주문진읍", "중앙동", "초당동", "포남1동", "포남2동", "홍제동"
                )),
                SubRegion(name = "고성군", districts = listOf(
                    "고성군 전체",
                    "간성읍", "거진읍", "수동면", "죽왕면", "토성면", "현내면"
                )),
                SubRegion(name = "동해시", districts = listOf(
                    "동해시 전체",
                    "동호동", "망상동", "묵호동", "발한동", "부곡동", "북삼동",
                    "북평동", "삼화동", "송정동", "천곡동", "평릉동"
                )),
                SubRegion(name = "삼척시", districts = listOf(
                    "삼척시 전체",
                    "가곡면", "교동", "근덕면", "남양동", "노곡면", "도계읍",
                    "미로면", "성내동", "신기면", "원덕읍", "정라동", "하장면"
                )),
                SubRegion(name = "속초시", districts = listOf(
                    "속초시 전체",
                    "교동", "금호동", "노학동", "대포동", "동명동", "영랑동",
                    "조양동", "청호동"
                )),
                SubRegion(name = "양구군", districts = listOf(
                    "양구군 전체",
                    "국토정중앙면", "동면", "방산면", "양구읍", "해안면"
                )),
                SubRegion(name = "양양군", districts = listOf(
                    "양양군 전체",
                    "강현면", "서면", "손양면", "양양읍", "현남면", "현북면"
                )),
                SubRegion(name = "영월군", districts = listOf(
                    "영월군 전체",
                    "김삿갓면", "남면", "무릉도원면", "북면", "상동읍", "영월읍",
                    "주천면", "중동면", "한반도면"
                )),
                SubRegion(name = "원주시", districts = listOf(
                    "원주시 전체",
                    "개운동", "귀래면", "단계동", "단구동", "명륜1동", "명륜2동",
                    "문막읍", "봉산동", "부론면", "소초면", "신림면", "우산동",
                    "원인동", "일산동", "중앙동", "지정면", "태장1동", "태장2동",
                    "판부면", "학성동", "행구동", "호저면", "흥업면"
                )),
                SubRegion(name = "인제군", districts = listOf(
                    "인제군 전체",
                    "기린면", "남면", "북면", "상남면", "서화면", "인제읍"
                )),
                SubRegion(name = "정선군", districts = listOf(
                    "정선군 전체",
                    "고한읍", "남면", "북평면", "사북읍", "신동읍", "여량면",
                    "임계면", "정선읍", "화암면"
                )),
                SubRegion(name = "철원군", districts = listOf(
                    "철원군 전체",
                    "갈말읍", "근남면", "근동면", "김화읍", "동송읍", "서면",
                    "원남면", "원동면", "임남면", "철원읍"
                )),
                SubRegion(name = "춘천시", districts = listOf(
                    "춘천시 전체",
                    "교동", "근화동", "남면", "남산면", "동내면", "동면", "동산면",
                    "북산면", "사북면", "서면", "석사동", "소양동", "신동면",
                    "신북읍", "약사명동", "온의동", "우두동", "조운동", "퇴계동",
                    "후평1동", "후평2동", "후평3동"
                )),
                SubRegion(name = "태백시", districts = listOf(
                    "태백시 전체",
                    "구문소동", "문곡소도동", "삼수동", "상장동", "장성동",
                    "조탄동", "철암동", "황지동"
                )),
                SubRegion(name = "평창군", districts = listOf(
                    "평창군 전체",
                    "대관령면", "대화면", "미탄면", "방림면", "봉평면",
                    "용평면", "진부면", "평창읍"
                )),
                SubRegion(name = "홍천군", districts = listOf(
                    "홍천군 전체",
                    "남면", "내면", "내촌면", "두촌면", "북방면", "서면",
                    "서석면", "영귀미면", "홍천읍", "화촌면"
                )),
                SubRegion(name = "화천군", districts = listOf(
                    "화천군 전체",
                    "간동면", "사내면", "상서면", "하남면", "화천읍"
                )),
                SubRegion(name = "횡성군", districts = listOf(
                    "횡성군 전체",
                    "갑천면", "강림면", "공근면", "둔내면", "서원면", "안흥면",
                    "우천면", "청일면", "횡성읍"
                ))
            )
        ),
        Region(
            name = "대전",
            subRegions = listOf(
                SubRegion(name = "대전 전체", districts = listOf("")),
                SubRegion(name = "동구", districts = listOf("동구 전체", "대동", "자양동")),
                SubRegion(name = "서구", districts = listOf("서구 전체", "둔산동", "갈마동")),
                SubRegion(name = "유성구", districts = listOf("유성구 전체", "봉명동", "구암동"))
            )
        ),
        Region(
            name = "울산",
            subRegions = listOf(
                SubRegion(name = "남구", districts = listOf("달동", "대현동", "무거동", "삼산동", "삼호동", "선암동", "수암동", "신정1동", "신정2동", "신정3동", "신정4동", "신정5동", "야음장생포동", "옥동")),
                SubRegion(name = "동구", districts = listOf("남목1동", "남목2동", "남목3동", "대송동", "방어동", "일산동", "전하1동", "전하2동", "화정동")),
                SubRegion(name = "북구", districts = listOf("강동동", "농소1동", "농소2동", "농소3동", "송정동", "양정동", "염포동", "효문동")),
                SubRegion(name = "울주군", districts = listOf("두동면", "두서면", "범서읍", "삼남읍", "삼동면", "상북면", "언양읍", "온산읍", "웅촌면", "청량읍")),
                SubRegion(name = "중구", districts = listOf("다운동", "반구1동", "반구2동", "병영1동", "병영2동", "복산1동", "복산2동", "성안동", "약사동", "우정동", "중앙동", "태화동", "학성동"))
            )
        ),
        Region(
            name = "경남",
            subRegions = listOf(
                SubRegion(name = "거제시", districts = listOf("거제면", "고현동", "남부면", "능포동", "동부면", "둔덕면", "사등면", "상문동", "수양동", "수월동", "아주동", "연초면", "옥포1동", "옥포2동", "일운면", "장목면", "장승포동", "장평동", "하청면")),
                SubRegion(name = "거창군", districts = listOf("가북면", "가조면", "거창읍", "고제면", "남상면", "남하면", "마리면", "북상면", "신원면", "웅양면", "위천면", "주상면")),
                SubRegion(name = "고성군", districts = listOf("개천면", "거류면", "고성읍", "구만면", "대가면", "동해면", "마암면", "삼산면", "상리면", "영오면", "영현면", "하이면", "하일면", "회화면")),
                SubRegion(name = "김해시", districts = listOf("내외동", "대동면", "동상동", "부원동", "불암동", "삼안동", "상동면", "생림면", "장유1동", "장유2동", "장유3동", "주촌면", "진례면", "진영읍", "칠산서부동", "한림면", "활천동", "회현동")),
                SubRegion(name = "남해군", districts = listOf("고현면", "남면", "남해읍", "미조면", "삼동면", "상주면", "서면", "설천면", "이동면", "창선면")),
                SubRegion(name = "밀양시", districts = listOf("가곡동", "교동", "내이동", "내일동", "단장면", "무안면", "부북면", "산내면", "산외면", "삼랑진읍", "삼문동", "상남면", "상동면", "청도면", "초동면", "하남읍")),
                SubRegion(name = "사천시", districts = listOf("곤명면", "곤양면", "남양동", "동서금동", "동서동", "벌룡동", "사남면", "사천읍", "서포면", "선구동", "용현면", "정동면", "축동면", "향촌동")),
                SubRegion(name = "산청군", districts = listOf("금서면", "단성면", "산청읍", "삼장면", "생비량면", "생초면", "시천면", "신등면", "신안면", "오부면", "읍면동", "차황면")),
                SubRegion(name = "양산시", districts = listOf("강서동", "덕계동", "동면", "물금읍", "삼성동", "상북면", "서창동", "소주동", "원동면", "중앙동", "평산동", "하북면")),
                SubRegion(name = "의령군", districts = listOf("가례면", "궁류면", "낙서면", "대의면", "봉수면", "부림면", "용덕면", "유곡면", "의령읍", "정곡면", "지정면", "칠곡면", "화정면")),
                SubRegion(name = "진주시", districts = listOf("가호동", "금곡면", "금산면", "내동면", "대곡면", "대평면", "명석면", "문산읍", "미천면", "사봉면", "상대동", "상봉동", "상평동", "성북동", "수곡면", "신안동", "이반성면", "이현동", "일반성면", "정촌면", "중앙동", "지수면", "진성면", "집현면", "천전동", "초장동", "충무공동", "판문동", "평거동", "하대동")),
                SubRegion(name = "창녕군", districts = listOf("계성면", "고암면", "남지읍", "대지면", "대합면", "성산면", "영산면", "유어면", "이방면", "장마면", "창녕읍")),
                SubRegion(name = "창원시", districts = listOf("가음정동", "경화동", "남양동", "대산면", "덕산동", "동읍", "명곡동", "반송동", "병암동", "봉림동", "북면", "사파동", "상남동", "석동", "성산구", "성주동", "소계동", "여좌동", "용지동", "웅남동", "웅동1동", "웅동2동", "의창구", "이동", "자은동", "장천동", "중앙동", "진해구", "충무동", "태백동", "팔룡동", "풍호동")),
                SubRegion(name = "통영시", districts = listOf("광도면", "도산면", "도천동", "명정동", "무전동", "미수동", "봉평동", "북신동", "사량면", "산양읍", "욕지면", "용남면", "정량동", "중앙동", "한산면")),
                SubRegion(name = "하동군", districts = listOf("고전면", "금남면", "금성면", "북천면", "악양면", "양보면", "옥종면", "적량면", "진교면", "청계면", "청암면", "하동읍", "화개면", "횡천면")),
                SubRegion(name = "함안군", districts = listOf("가야읍", "군북면", "대산면", "법수면", "산인면", "여항면", "칠북면", "칠서면", "칠원읍", "함안면")),
                SubRegion(name = "함양군", districts = listOf("마천면", "백전면", "병곡면", "서상면", "서하면", "수동면", "안의면", "유림면", "지곡면", "함양읍", "휴천면")),
                SubRegion(name = "합천군", districts = listOf("가야면", "가회면", "대병면", "대양면", "덕곡면", "묘산면", "봉산면", "삼가면", "쌍백면", "쌍책면", "야로면", "용주면", "율곡면", "적중면", "청덕면", "초계면", "합천읍"))
            )
        ),
        Region(
            name = "경북",
            subRegions = listOf(
                SubRegion(name = "경산시", districts = listOf("남부동", "남산면", "남천면", "동부동", "북부동", "서부1동", "서부2동", "압량동", "압량읍", "와촌면", "용성면", "자인면", "중방동", "중앙동", "진량읍", "하양읍")),
                SubRegion(name = "경주시", districts = listOf("감포읍", "강동면", "건천읍", "내남면", "동천동", "보덕동", "불국동", "산내면", "서면", "선도동", "안강읍", "양남면", "양북면", "외동읍", "월성동", "천북면", "현곡면", "황성동")),
                SubRegion(name = "고령군", districts = listOf("개진면", "고령읍", "다산면", "덕곡면", "성산면", "쌍림면", "우곡면", "운수면")),
                SubRegion(name = "구미시", districts = listOf("고아읍", "공단동", "광평동", "도개면", "도량동", "무을면", "비산동", "산동읍", "상모사곡동", "선산읍", "선주원남동", "송정동", "신평동", "양포동", "옥성면", "원평동", "인동동", "임오동", "장천면", "지산동", "진미동", "해평면", "형곡1동", "형곡2동")),
                SubRegion(name = "김천시", districts = listOf("감문면", "감천면", "개령면", "구성면", "남면", "농소면", "대곡동", "대덕면", "대신동", "대항면", "봉산면", "부항면", "아포읍", "양금동", "어모면", "율곡동", "자산동", "조마면", "증산면", "지례면", "지좌동", "평화남산동")),
                SubRegion(name = "문경시", districts = listOf("가은읍", "농암면", "동로면", "마성면", "문경읍", "산북면", "산양면", "영순면", "점촌1동", "점촌2동", "점촌3동", "점촌4동", "점촌5동", "호계면")),
                SubRegion(name = "봉화군", districts = listOf("명호면", "물야면", "법전면", "봉성면", "봉화읍", "상운면", "석포면", "소천면", "재산면", "춘양면")),
                SubRegion(name = "상주시", districts = listOf("계림동", "공검면", "공성면", "낙동면", "남원동", "내서면", "동문동", "동성동", "모동면", "모서면", "북문동", "사벌국면", "신흥동", "외남면", "외서면", "은척면", "이안면", "중동면", "청리면", "함창읍", "화남면", "화동면", "화북면", "화서면")),
                SubRegion(name = "성주군", districts = listOf("가천면", "금수면", "대가면", "벽진면", "선남면", "성주읍", "수륜면", "용암면", "월항면", "초전면")),
                SubRegion(name = "안동시", districts = listOf("강남동", "길안면", "남선면", "남후면", "녹전면", "도산면", "명륜동", "북후면", "서후면", "송하동", "안기동", "예안면", "옥동", "와룡면", "용상동", "일직면", "임동면", "임하면", "중구동", "태화동", "평화동", "풍산읍", "풍천면")),
                SubRegion(name = "영덕군", districts = listOf("강구면", "남정면", "달산면", "병곡면", "영덕읍", "영해면", "지품면", "창수면", "축산면")),
                SubRegion(name = "영양군", districts = listOf("석보면", "수비면", "영양읍", "일월면", "입암면", "청기면")),
                SubRegion(name = "영주시", districts = listOf("가흥1동", "가흥2동", "단산면", "문수면", "봉현면", "부석면", "상망동", "순흥면", "안정면", "영주1동", "영주2동", "이산면", "장수면", "평은면", "풍기읍", "하망동", "휴천1동", "휴천2동", "휴천3동")),
                SubRegion(name = "영천시", districts = listOf("고경면", "금호읍", "남부동", "대창면", "동부동", "북부동", "북안면", "서부동", "신녕면", "완산동", "임고면", "자양면", "중앙동", "청통면", "화남면", "화북면", "화산면")),
                SubRegion(name = "예천군", districts = listOf("감천면", "개포면", "보문면", "예천읍", "용궁면", "용문면", "유천면", "은풍면", "지보면", "풍양면", "호명면", "효자면")),
                SubRegion(name = "울릉군", districts = listOf("북면", "서면", "울릉읍")),
                SubRegion(name = "울진군", districts = listOf("근남면", "금강송면", "기성면", "매화면", "북면", "온정면", "울진읍", "죽변면", "평해읍", "후포면")),
                SubRegion(name = "의성군", districts = listOf("가음면", "구천면", "금성면", "다인면", "단밀면", "단북면", "단촌면", "봉양면", "비안면", "사곡면", "신평면", "안계면", "안사면", "안평면", "옥산면", "의성읍", "점곡면", "춘산면")),
                SubRegion(name = "청도군", districts = listOf("각남면", "각북면", "금천면", "매전면", "운문면", "이서면", "청도읍", "풍각면", "화양읍")),
                SubRegion(name = "청송군", districts = listOf("부남면", "안덕면", "주왕산면", "진보면", "청송읍", "파천면", "현동면", "현서면")),
                SubRegion(name = "칠곡군", districts = listOf("가산면", "기산면", "동명면", "북삼읍", "석적읍", "약목면", "왜관읍", "지천면")),
                SubRegion(name = "포항시", districts = listOf("구룡포읍", "기계면", "기북면", "남구", "대송면", "대이동", "대잠동", "동해면", "두호동", "북구", "상도동", "송도동", "송라면", "신광면", "양학동", "연일읍", "오천읍", "용흥동", "우창동", "장기면", "장량동", "제철동", "죽장면", "청림동", "청하면", "해도동", "호미곶면", "환여동", "효곡동", "흥해읍"))
            )
        ),
        Region(
            name = "충남",
            subRegions = listOf(
                SubRegion(name = "계룡시", districts = listOf("금암동", "두마면", "신도안면", "엄사면")),
                SubRegion(name = "공주시", districts = listOf("계룡면", "금학동", "반포면", "사곡면", "신관동", "신풍면", "옥룡동", "우성면", "웅진동", "유구읍", "의당면", "이인면", "정안면", "중학동", "탄천면")),
                SubRegion(name = "금산군", districts = listOf("군북면", "금산읍", "남이면", "남일면", "복수면", "부리면", "제원면", "진산면", "추부면")),
                SubRegion(name = "논산시", districts = listOf("가야곡면", "강경읍", "광석면", "노성면", "벌곡면", "부적면", "부창동", "상월면", "성동면", "양촌면", "연무읍", "연산면", "은진면", "채운면", "취암동")),
                SubRegion(name = "당진시", districts = listOf("고대면", "당진1동", "당진2동", "당진3동", "대호지면", "면천면", "석문면", "송산면", "순성면", "신평면", "우강면", "정미면", "합덕읍")),
                SubRegion(name = "보령시", districts = listOf("남포면", "대천1동", "대천2동", "대천3동", "대천4동", "대천5동", "미산면", "성주면", "오천면", "웅천읍", "주교면", "주포면", "천북면", "청라면", "청소면")),
                SubRegion(name = "부여군", districts = listOf("구룡면", "규암면", "남면", "내산면", "부여읍", "석성면", "세도면", "양화면", "옥산면", "외산면", "은산면", "임천면", "장암면", "초촌면", "충화면", "홍산면")),
                SubRegion(name = "서산시", districts = listOf("고북면", "대산읍", "동문1동", "동문2동", "부석면", "부춘동", "석남동", "성연면", "수석동", "운산면", "음암면", "인지면", "지곡면", "팔봉면", "해미면")),
                SubRegion(name = "서천군", districts = listOf("기산면", "마산면", "마서면", "문산면", "비인면", "서면", "서천읍", "시초면", "장항읍", "종천면", "판교면", "한산면", "화양면")),
                SubRegion(name = "아산시", districts = listOf("도고면", "둔포면", "배방읍", "선장면", "송악면", "신창면", "염치읍", "영인면", "온양1동", "온양2동", "온양3동", "온양4동", "온양5동", "온양6동", "음봉면", "인주면", "탕정면")),
                SubRegion(name = "예산군", districts = listOf("고덕면", "광시면", "대술면", "대흥면", "덕산면", "봉산면", "삽교읍", "신암면", "신양면", "예산읍", "오가면", "응봉면")),
                SubRegion(name = "천안시", districts = listOf("광덕면", "구성동", "동남구", "동면", "목천읍", "문성동", "백석동", "병천면", "봉명동", "부성1동", "부성2동", "북면", "불당1동", "불당2동", "서북구", "성남면", "성정1동", "성정2동", "성환읍", "수신면", "신방동", "신안동", "쌍용1동", "쌍용2동", "쌍용3동", "원성1동", "원성2동", "일봉동", "입장면", "중앙동", "직산읍", "청룡동", "풍세면")),
                SubRegion(name = "청양군", districts = listOf("남양면", "대치면", "목면", "운곡면", "장평면", "정산면", "청남면", "청양읍", "화성면")),
                SubRegion(name = "태안군", districts = listOf("고남면", "근흥면", "남면", "소원면", "안면읍", "원북면", "이원면", "태안읍")),
                SubRegion(name = "홍성군", districts = listOf("갈산면", "결성면", "광천읍", "구항면", "금마면", "서부면", "은하면", "장곡면", "홍동면", "홍북읍", "홍성읍"))
            )
        ),
        Region(
            name = "충북",
            subRegions = listOf(
                SubRegion(name = "괴산군", districts = listOf("감물면", "괴산읍", "문광면", "불정면", "사리면", "소수면", "연풍면", "장연면", "청안면", "청천면", "칠성면")),
                SubRegion(name = "단양군", districts = listOf("가곡면", "단성면", "단양읍", "대강면", "매포읍", "어상천면", "영춘면", "적성면")),
                SubRegion(name = "보은군", districts = listOf("내북면", "마로면", "보은읍", "산외면", "삼승면", "속리산면", "수한면", "장안면", "탄부면", "회남면", "회인면")),
                SubRegion(name = "영동군", districts = listOf("매곡면", "상촌면", "심천면", "양강면", "양산면", "영동읍", "용산면", "용화면", "추풍령면", "학산면", "황간면")),
                SubRegion(name = "옥천군", districts = listOf("군북면", "군서면", "동이면", "안남면", "안내면", "옥천읍", "이원면", "청산면", "청성면")),
                SubRegion(name = "음성군", districts = listOf("감곡면", "금왕읍", "대소면", "맹동면", "삼성면", "생극면", "소이면", "원남면", "음성읍")),
                SubRegion(name = "제천시", districts = listOf("금성면", "남현동", "덕산면", "동현동", "백운면", "봉양읍", "송학면", "수산면", "신백동", "영서동", "의림지동", "중앙동", "청전동", "청풍면", "한수면", "화산동")),
                SubRegion(name = "증평군", districts = listOf("도안면", "증평읍")),
                SubRegion(name = "진천군", districts = listOf("광혜원면", "덕산읍", "문백면", "백곡면", "이월면", "진천읍", "초평면")),
                SubRegion(name = "청주시", districts = listOf("가경동", "가덕면", "강내면", "강서1동", "강서2동", "남이면", "남일면", "낭성면", "내덕1동", "내덕2동", "내수읍", "모충동", "문의면", "미원면", "복대1동", "복대2동", "봉명1동", "봉명2동", "북이면", "분평동", "사직1동", "사직2동", "사창동", "산남동", "상당구", "서원구", "성안동", "성화개신죽림동", "송정동", "수곡1동", "수곡2동", "영운동", "오근장동", "오송읍", "오창읍", "옥산면", "용담명암산성동", "용암1동", "용암2동", "우암동", "운천신봉동", "율량사천동", "중앙동", "청원구", "탑대성동", "현도면", "흥덕구")),
                SubRegion(name = "충주시", districts = listOf("교현2동", "교현안림동", "금가면", "노은면", "달천동", "대소원면", "동량면", "목행용탄동", "문화동", "봉방동", "산척면", "살미면", "성내충인동", "소태면", "수안보면", "신니면", "앙성면", "엄정면", "연수동", "주덕읍", "중앙탑면", "칠금금릉동", "호암직동"))
            )
        ),
        Region(
            name = "전남",
            subRegions = listOf(
                SubRegion(name = "강진군", districts = listOf("강진읍", "군동면", "대구면", "도암면", "마량면", "병영면", "성전면", "신전면", "옴천면", "작천면", "칠량면")),
                SubRegion(name = "고흥군", districts = listOf("고흥읍", "과역면", "금산면", "남양면", "대서면", "도덕면", "도양읍", "도화면", "동강면", "동일면", "두원면", "봉래면", "영남면", "점암면", "포두면", "풍양면")),
                SubRegion(name = "곡성군", districts = listOf("겸면", "고달면", "곡성읍", "목사동면", "삼기면", "석곡면", "오곡면", "오산면", "옥과면", "입면", "죽곡면")),
                SubRegion(name = "광양시", districts = listOf("골약동", "광양읍", "광영동", "금호동", "다압면", "봉강면", "옥곡면", "옥룡면", "중마동", "진상면", "진월면")),
                SubRegion(name = "구례군", districts = listOf("간전면", "광의면", "구례읍", "마산면", "문척면", "산동면", "용방면", "토지면")),
                SubRegion(name = "나주시", districts = listOf("공산면", "금남동", "금천면", "남평읍", "노안면", "다도면", "다시면", "문평면", "반남면", "봉황면", "빛가람동", "산포면", "성북동", "세지면", "송월동", "영강동", "영산동", "왕곡면", "이창동")),
                SubRegion(name = "담양군", districts = listOf("가사문학면", "고서면", "금성면", "담양읍", "대덕면", "대전면", "무정면", "봉산면", "수북면", "용면", "월산면", "창평면")),
                SubRegion(name = "목포시", districts = listOf("대성동", "동명동", "만호동", "목원동", "부흥동", "북항동", "산정동", "삼학동", "삼향동", "상동", "신흥동", "연동", "연산동", "옥암동", "용당1동", "용당2동", "원산동", "유달동", "이로동", "죽교동", "하당동")),
                SubRegion(name = "무안군", districts = listOf("망운면", "몽탄면", "무안읍", "삼향읍", "운남면", "일로읍", "청계면", "해제면", "현경면")),
                SubRegion(name = "보성군", districts = listOf("겸백면", "노동면", "득량면", "문덕면", "미력면", "벌교읍", "보성읍", "복내면", "웅치면", "율어면", "조성면", "회천면")),
                SubRegion(name = "순천시", districts = listOf("낙안면", "남제동", "도사동", "별량면", "상사면", "서면", "송광면", "승주읍", "왕조1동", "왕조2동", "외서면", "월등면", "장천동", "저전동", "주암면", "중앙동", "해룡면", "황전면")),
                SubRegion(name = "신안군", districts = listOf("도초면", "비금면", "신의면", "안좌면", "암태면", "압해읍", "임자면", "자은면", "장산면", "증도면", "지도읍", "태평면", "팔금면", "하의면", "흑산면")),
                SubRegion(name = "여수시", districts = listOf("광림동", "국동", "남면", "대교동", "돌산읍", "동문동", "둔덕동", "만덕동", "묘도동", "문수동", "미평동", "삼산면", "삼일동", "서강동", "소라면", "시전동", "쌍봉동", "여서동", "여천동", "월호동", "율촌면", "주삼동", "중앙동", "한려동", "화양면", "화정면")),
                SubRegion(name = "영광군", districts = listOf("군남면", "군서면", "대마면", "묘량면", "백수읍", "법성면", "불갑면", "염산면", "영광읍", "홍농읍")),
                SubRegion(name = "영암군", districts = listOf("군서면", "금정면", "덕진면", "도포면", "미암면", "삼호읍", "서호면", "시종면", "신북면", "영암읍", "학산면")),
                SubRegion(name = "완도군", districts = listOf("고금면", "군외면", "금당면", "금일읍", "노화읍", "보길면", "생일면", "소안면", "신지면", "약산면", "완도읍", "청산면")),
                SubRegion(name = "장성군", districts = listOf("남면", "동화면", "북이면", "북일면", "북하면", "삼계면", "삼서면", "서삼면", "장성읍", "진원면", "황룡면")),
                SubRegion(name = "장흥군", districts = listOf("관산읍", "대덕읍", "부산면", "안양면", "용산면", "유치면", "장동면", "장평면", "장흥읍", "회진면")),
                SubRegion(name = "진도군", districts = listOf("고군면", "군내면", "의신면", "임회면", "조도면", "지산면", "진도읍")),
                SubRegion(name = "함평군", districts = listOf("나산면", "대동면", "손불면", "신광면", "엄다면", "월야면", "학교면", "함평읍", "해보면")),
                SubRegion(name = "해남군", districts = listOf("계곡면", "마산면", "문내면", "북일면", "북평면", "삼산면", "송지면", "옥천면", "해남읍", "현산면", "화산면", "화원면", "황산면")),
                SubRegion(name = "화순군", districts = listOf("능주면", "도곡면", "도암면", "동면", "동복면", "백아면", "사평면", "이서면", "이양면", "청풍면", "춘양면", "한천면", "화순읍"))
            )
        ),
        Region(
            name = "전북",
            subRegions = listOf(
                SubRegion(name = "고창군", districts = listOf("고수면", "고창읍", "공음면", "대산면", "무장면", "부안면", "상하면", "성내면", "성송면", "신림면", "심원면", "아산면", "해리면", "흥덕면")),
                SubRegion(name = "군산시", districts = listOf("개정동", "개정면", "경암동", "구암동", "나운1동", "나운2동", "나운3동", "나포면", "대야면", "미성동", "삼학동", "서수면", "성산면", "소룡동", "수송동", "신풍동", "옥구읍", "옥도면", "옥산면", "옥서면", "월명동", "임피면", "조촌동", "중앙동", "해신동", "회현면", "흥남동")),
                SubRegion(name = "김제시", districts = listOf("검산동", "공덕면", "광활면", "교월동", "금구면", "금산면", "만경읍", "백구면", "백산면", "봉남면", "부량면", "성덕면", "신풍동", "요촌동", "용지면", "죽산면", "진봉면", "청하면", "황산면")),
                SubRegion(name = "남원시", districts = listOf("금지면", "노암동", "대강면", "대산면", "덕과면", "동충동", "보절면", "사매면", "산내면", "산동면", "송동면", "수지면", "아영면", "왕정동", "운봉읍", "이백면", "인월면", "주생면", "주천면", "죽항동", "향교동")),
                SubRegion(name = "무주군", districts = listOf("무주읍", "무풍면", "부남면", "설천면", "안성면", "적상면")),
                SubRegion(name = "부안군", districts = listOf("계화면", "동진면", "백산면", "보안면", "부안읍", "상서면", "위도면", "주산면", "줄포면", "진서면", "하서면", "행안면")),
                SubRegion(name = "순창군", districts = listOf("구림면", "금과면", "동계면", "복흥면", "순창읍", "쌍치면", "유등면", "인계면", "적성면", "팔덕면", "풍산면")),
                SubRegion(name = "완주군", districts = listOf("경천면", "고산면", "구이면", "동상면", "봉동읍", "비봉면", "삼례읍", "상관면", "소양면", "용진읍", "운주면", "이서면", "화산면")),
                SubRegion(name = "익산시", districts = listOf("금마면", "남중동", "낭산면", "덕기면", "동산동", "마동", "망성면", "부송동", "삼기면", "삼성동", "성당면", "어양동", "여산면", "영등1동", "영등2동", "오산면", "왕궁면", "용동면", "용안면", "웅포면", "인화동", "춘포면", "팔봉동", "평화동", "함라면", "함열읍", "황등면")),
                SubRegion(name = "임실군", districts = listOf("강진면", "관촌면", "덕치면", "삼계면", "성수면", "신평면", "오수면", "운암면", "임실읍", "지사면", "청웅면")),
                SubRegion(name = "장수군", districts = listOf("계남면", "계북면", "번암면", "산서면", "장계면", "장수읍", "천천면")),
                SubRegion(name = "전주시", districts = listOf("금암1동", "금암2동", "노송동", "덕진구", "덕진동", "동서학동", "삼천1동", "삼천2동", "삼천3동", "서서학동", "서신동", "송천1동", "송천2동", "여의동", "완산구", "완산동", "우아1동", "우아2동", "인후1동", "인후2동", "인후3동", "조촌동", "중앙동", "중화산1동", "중화산2동", "진북동", "팔복동", "평화1동", "평화2동", "풍남동", "혁신동", "호성동", "효자1동", "효자2동", "효자3동", "효자4동")),
                SubRegion(name = "정읍시", districts = listOf("감곡면", "고부면", "내장상동", "농소동", "덕천면", "북면", "산내면", "산외면", "소성면", "수성동", "시기동", "신태인읍", "연지동", "영원면", "옹동면", "이평면", "입암면", "장명동", "정우면", "칠보면", "태인면")),
                SubRegion(name = "진안군", districts = listOf("동향면", "마령면", "백운면", "부귀면", "성수면", "안천면", "용담면", "정천면", "주천면", "진안읍"))
            )
        ),
        Region(
            name = "제주",
            subRegions = listOf(
                SubRegion(name = "서귀포시", districts = listOf("남원읍", "대륜동", "대정읍", "대천동", "동홍동", "서홍동", "성산읍", "송산동", "안덕면", "영천동", "예래동", "정방동", "중문동", "중앙동", "천지동", "표선면", "효돈동")),
                SubRegion(name = "제주시", districts = listOf("건입동", "구좌읍", "노형동", "도두동", "봉개동", "삼도1동", "삼도2동", "삼양동", "아라동", "애월읍", "연동", "오라동", "외도동", "용담1동", "용담2동", "우도면", "이도1동", "이도2동", "이호동", "일도1동", "일도2동", "조천읍", "추자면", "한경면", "한림읍", "화북동"))
            )
        ),
        Region(
            name = "세종",
            subRegions = listOf(
                SubRegion(name = "세종 전체", districts = listOf("")),
                SubRegion(name = "세종시", districts = listOf(
                    "세종시 전체",
                    "고운동", "금남면", "다정동", "대평동", "도담동", "반곡동",
                    "보람동", "부강면", "새롬동", "소담동", "소정면", "아름동",
                    "연기면", "연동면", "연서면", "장군면", "전동면", "전의면",
                    "종촌동", "한솔동", "합강동", "해밀동"
                ))
            )
        )
    )
}